app/Services/TwoCanPaymentService.php

    public function createPayment(User $user, float $amount, string $description = 'Пополнение баланса', ?string $cardToken = null): array
    {
        // Валидация суммы
        if ($amount < config('twocan.min_amount') || $amount > config('twocan.max_amount')) {
            throw new \InvalidArgumentException('Сумма платежа вне допустимого диапазона');
        }

        // Генерация уникального ID платежа
        $paymentId = 'payment_' . $user->id . '_' . time() . '_' . Str::random(8);

        // Создание транзакции в базе данных
        $transaction = Transaction::create([
            'transaction_id' => 'txn_' . $user->id . '_' . time(),
            'user_id' => $user->id,
            'token_id' => null, // Для RUB депозитов token_id = null
            'type' => 'deposit',
            'deposit_type' => 'rub',
            'amount' => $amount,
            'price' => 1.00, // Для RUB цена = 1
            'total_amount' => $amount, // Для RUB совпадает с amount
            'status' => 'pending',
            'payment_reference' => $paymentId,
            'metadata' => [
                'payment_system' => '2can',
                'shop_id' => $this->shopId,
            ]
        ]);
---
insert into `transactions` (`transaction_id`, `user_id`, `token_id`, `type`, `deposit_type`, `amount`, `price`, `total_amount`, `status`, `payment_reference`, `metadata`, `updated_at`, `created_at`) values ('txn_29_1764504954', 29, null, 'deposit', 'rub', 300, 1, 300, 'pending', 'payment_29_1764504954_mdgIiAFn', '{\"payment_system\":\"2can\",\"shop_id\":\"1337\"}', '2025-11-30 12:15:54', '2025-11-30 12:15:54')

                ];
            } else {
                // Обновление статуса транзакции при ошибке
                $transaction->update(['status' => 'failed']);
---
update `transactions` set `status` = 'failed', `transactions`.`updated_at` = '2025-11-30 12:15:55' where `id` = 10