app/Http/Controllers/AdminController.php

select count(*) as aggregate from `users` where `is_active` = 1
select count(*) as aggregate from `transactions`
select count(*) as aggregate from `transactions` where `status` = 'pending'
select count(*) as aggregate from `transactions` where `status` = 'completed'
select count(*) as aggregate from `tokens`
select count(*) as aggregate from `tokens` where `is_active` = 1
select * from `tokens` where `tokens`.`id` in (1, 2, 3)
select * from `transactions` order by `created_at` desc limit 10
select * from `users` where `users`.`id` in (29, 30, 31)
select * from `audit_logs` order by `created_at` desc limit 10
select * from `users` where `users`.`id` in (27, 29, 30)
---
    public function dashboard()
    {
        // Get statistics
        $stats = [
            'total_users' => User::count(),
            'active_users' => User::where('is_active', true)->count(),
            'total_transactions' => Transaction::count(),
            'pending_transactions' => Transaction::where('status', 'pending')->count(),
            'completed_transactions' => Transaction::where('status', 'completed')->count(),
            'total_tokens' => Token::count(),
            'active_tokens' => Token::where('is_active', true)->count(),
        ];

        // Get recent activity
        $recentTransactions = Transaction::with(['user', 'token'])
            ->latest()
            ->limit(10)
            ->get();

        $recentAuditLogs = AuditLog::with('user')
            ->latest()
            ->limit(10)
            ->get();

select * from `transactions` where `transactions`.`user_id` in (27, 28, 29, 30, 31, 32, 33, 34)
select * from `users` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `users`
---
    public function users()
    {
        $users = User::with('transactions')
            ->latest()
            ->paginate(20);

select * from `tokens` where `tokens`.`id` in (1)
select * from `transactions` where `transactions`.`user_id` in (29)
select * from `user_balances` where `user_balances`.`user_id` in (29)
select * from `winner_losers` where `winner_losers`.`user_id` in (29)
---
    public function showUser(User $user)
    {
        $user->load(['transactions.token', 'balances.token', 'winnerLosers.token', 'userGroups']);

select * from `tokens` where `tokens`.`id` in (1, 2, 3)
select * from `transactions` order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (29, 30, 31)
select count(*) as aggregate from `transactions`
---
    public function transactions()
    {
        $transactions = Transaction::with(['user', 'token'])
            ->latest()
            ->paginate(20);

select * from `users` where `users`.`id` in (29)
---
    public function showTransaction(Transaction $transaction)
    {
        $transaction->load(['user', 'token']);

select * from `tokens`
select * from `user_balances` where `user_balances`.`token_id` in (1, 2, 3)
---
    public function tokens()
    {
        $tokens = Token::with('userBalances')->get();

select * from `audit_logs` order by `created_at` desc limit 50 offset 0
select * from `users` where `users`.`id` in (27, 29, 30)
select count(*) as aggregate from `audit_logs`
---
    public function auditLogs()
    {
        $auditLogs = AuditLog::with('user')
            ->latest()
            ->paginate(50);