app/Http/Controllers/BrokerController.php

select * from `brokers` where `user_id` = 28 limit 1
---
    public function dashboard()
    {
        $broker = Broker::where('user_id', Auth::id())->first();