app/Http/Controllers/ClientController.php

    public function dashboard()
    {
        $user = Auth::user();

        // Get user balances
        $balances = UserBalance::with('token')
            ->where('user_id', $user->id)
            ->get();

        // Get recent transactions
        $recentTransactions = Transaction::with('token')
            ->where('user_id', $user->id)
            ->latest()
            ->limit(10)
            ->get();
---
select * from `tokens` where `tokens`.`id` in (1, 2, 3)
select * from `user_balances` where `user_id` = 29
select * from `tokens` where `tokens`.`id` in (1)
select * from `transactions` where `user_id` = 29 order by `created_at` desc limit 10

    public function showSell()
    {
        $user = Auth::user();
        $balances = UserBalance::with('token')
            ->where('user_id', $user->id)
            ->where('balance', '>', 0)
            ->get();
---
select * from `tokens` where `tokens`.`id` in (1, 2, 3)
select * from `user_balances` where `user_id` = 29 and `balance` > 0

    public function transactions()
    {
        $user = Auth::user();
        $transactions = Transaction::with('token')
            ->where('user_id', $user->id)
            ->latest()
            ->paginate(20);
---
select * from `tokens` where `tokens`.`id` in (1)
select * from `transactions` where `user_id` = 29 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 29