app/Http/Controllers/UserGroupController.php

select * from `user_groups` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `user_groups`
---
    public function index()
    {
        $groups = UserGroup::orderByDesc('id')->paginate(20);